erpdev.СХК_Расширение/src/Documents/ПриобретениеУслугПрочихАктивов/ПриобретениеУслугПрочихАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриобретениеУслугПрочихАктивов</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="3ce5c98b-cf73-4229-9a8c-d648aeb0c02e">
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="439fd9aa-6f69-4ef5-9a7f-faa416a7086b">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="4360b5bc-ed05-4557-a458-d5fd0c7b026a">
    <name>Расходы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="1e1c2d1e-5586-4eb7-828c-5412f8ff2d73">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/InformationRegisters/СтатусыДокументов/СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыДокументов</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовПоступления</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеУслугПоАренде</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/Documents/ПриобретениеУслугПрочихАктивов/Forms/ФормаДокумента/Module.bsl
Функция ЕстьОригиналДокумента()
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СтатусыДокументов.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	               |ГДЕ
	               |	СтатусыДокументов.Организация = &Организация
	               |	И СтатусыДокументов.Документ = &Документ";
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Документ", объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.Статус = Перечисления.СтатусыДокументовПоступления.ОригиналПолучен Тогда
			Возврат истина;
		Иначе Возврат ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
		
КонецФункции

&НаСервере
Процедура Расш1_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	НаборЗаписей = РегистрыСведений.СтатусыДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(ТекущийОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	Запись = НаборЗаписей.Добавить();
	Запись.Организация = ТекущийОбъект.Организация;
	Запись.Документ = ТекущийОбъект.Ссылка;
	Если ПолученОригинал Тогда
		Запись.Статус = Перечисления.СтатусыДокументовПоступления.ОригиналПолучен;
	Иначе
		Запись.Статус = Перечисления.СтатусыДокументовПоступления.ОригиналНеПолучен;
	КонецЕсли;
	НаборЗаписей.Записать(1);
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	ПолученОригинал = ЕстьОригиналДокумента();

КонецПроцедуры
